Revit 2023 API
ExternallyTaggedGeometryValidation Methods
The ExternallyTaggedGeometryValidation type exposes the following members.
Methods
Name | Description
IsNonSolid
 Makes sure that the input geometry object is not a Solid.
IsSolid
 Makes sure that the input geometry object is a Solid.
IsValidGeometry
 Validates the input geometry to be stored in an externally tagged geometry object. Valid types of geometry are: Solid, Mesh, GeometryInstance, Point and Curve.
See Also
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace